;; -*- no-byte-compile: t; -*-
;;; lang/markdown/packages.el

(package! markdown-mode)
(package! markdown-ts-mode)
(package! markdown-toc)
(package! edit-indirect)
(package! ox-gfm)
(package! auto-org-md)
(package! grip-mode)

(package! evil-markdown :recipe (:host github :repo "Somelauw/evil-markdown"))
