;; -*- no-byte-compile: t; -*-
;;; lang/jg-misc-lang/packages.el

(package! flycheck-plantuml)
(package! plantuml-mode)
(package! gradle-mode)
(package! groovy-mode)
(package! pasp-mode)

(package! agentspeak-mode :recipe (:local-repo "~/.doom.d/packages/agentspeak-mode"))
(package! ceptre-mode :recipe (:local-repo "~/.doom.d/packages/ceptre-mode"))
(package! instal-mode :recipe (:local-repo "~/.doom.d/packages/instal-mode"))
(package! jacamo-mode :recipe (:local-repo "~/.doom.d/packages/jacamo-mode"))
(package! versu-mode :recipe (:local-repo "~/.doom.d/packages/versu-mode"))
