(package! (trie-face :location local))
(package! (trie-tree :location local))
(package! (trie-mode :location local))
(package! (trie-sequence-mode :location local))
(package! (trie-explore-mode :location local))
(package! (trie-minor-mode :location local))
(package! (parsec :location elpa :step pre))
(package! (font-lock+ :location (recipe :fetcher git :url "https://github.com/emacsmirror/font-lock-plus")))
(package! helm)
