;; -*- no-byte-compile: t; -*-
;;; tools/debugger/packages.el

(package! realgud)
(package! realgud-trepan-ni)
(package! realgud-lldb)
(package! realgud-ipdb)
(package! realgud-jdb)
(package! realgud-node-inspect)
(package! realgud-node-debug)


(package! dap-mode)

(package! edebug-x)

(package! font-lock-studio)

(package! pdb-capf)
