(package! academic-phrases)
(package! evil-org)
(package! helm-org)
(package! org)
(package! org-drill)
(package! org-pomodoro)
(package! org-projectile)
(package! org-ref)
(package! org-superstar)
(package! outline-toc)
