(package! abbrev)
(package! avy)
(package! dired)
(package! dired-quick-sort)
(package! dired-x)
(package! evil)
(package! evil-iedit-state)
(package! evil-quickscope)
(package! evil-vimish-fold)
(package! exec-path-from-shell)
(package! f)
(package! flycheck)
(package! helm)
(package! helm-gtags)
(package! hi-lock :built-in)
(package! ibuffer)
(package! neotree)
(package! origami)
(package! pyenv-mode)
(package! python)
(package! pyvenv)
(package! s)
(package! shell-pop)
(package! swiper)
(package! vimish-fold)
(package! vlf)
(package! which-key)
(package! yasnippet)
(package! yasnippet-snippets)


