;; -*- no-byte-compile: t; -*-
;;; domain-specific/bibtex/packages.el

(package! bibtex :built-in 'prefer)
(package! cl-lib :built-in t)
(package! dash)
(package! evil)
(package! helm)
(package! helm-bibtex)
(package! ivy-bibtex)
(package! hydra)
(package! org-ref)
(package! parsebib)
(package! citeproc)
