(package! avy)
(package! dired-quick-sort)
(package! evil)
(package! evil-iedit-state)
(package! evil-quickscope)
(package! evil-snipe)
(package! exec-path-from-shell)
(package! f)
(package! flycheck)
(package! helm)
(package! helm-gtags)
(package! neotree)
(package! origami)
(package! shell-pop)
(package! swiper)
(package! vlf)
(package! yasnippet)
(package! yasnippet-snippets)
(package! doom-snippets)
(package! auto-highlight-symbol)
(package! centered-cursor-mode)
(package! evil-visual-mark-mode)
(package! cedet :built-in 'prefer)

(package! evil-iedit-state)
(package! semantic)
