;; -*- no-byte-compile: t; -*-
;;; lang/java/packages.el

(package! android-mode)
(package! flycheck-kotlin)
(package! gradle-mode)
(package! kotlin-mode)
(package! kotlin-ts-mode)
(package! sbt-mode)
(package! scala-mode)
(package! lsp-metals)
(package! lsp-java)
(package! ob-kotlin)
(package! flycheck-gradle)
