(package! trie-face :recipe (:local-repo "~/.doom.d/packages/trie-face")
(package! trie-tree :recipe (:local-repo "~/.doom.d/packages/trie-tree")
(package! trie-mode :recipe (:local-repo "~/.doom.d/packages/trie-mode")
(package! trie-sequence-mode :recipe (:local-repo "~/.doom.d/packages/trie-sequence-mode")
(package! trie-explore-mode :recipe (:local-repo "~/.doom.d/packages/trie-explore-mode")
(package! trie-minor-mode :recipe (:local-repo "~/.doom.d/packages/trie-minor-mode")
(package! parsec)
(package! (font-lock+ :location (recipe :fetcher git :url "https://github.com/emacsmirror/font-lock-plus")))
(package! helm)
(package! cl-lib)
