;; (package! fci)
(package! avy)
(package! cedet :built-in 'prefer)
(package! dired-quick-sort)
(package! evil)
(package! evil-iedit-state)
(package! evil-iedit-state)
(package! evil-quickscope)
(package! evil-snipe)
(package! exec-path-from-shell)
(package! f)
(package! flycheck)
(package! free-keys)
(package! fsm)
(package! neotree)
(package! origami)
(package! semantic)
(package! shell-pop)
(package! timeline-mode :recipe `(:local-repo ,(expand-file-name "packages/major-modes/timeline-mode" doom-user-dir)))
(package! vlf)
