;;; packages.el -*- lexical-binding: t; no-byte-compile: t; -*-
;;-- Header
;; File Commentary:
;;
;;
;; See footer for licenses/metadata/notes as applicable
;;-- end Header

(package! ess)
(package! ess-R-data-view)
(package! polymode)
(package! poly-R)

(package! stan-mode)
(package! eldoc-stan)
(package! company-stan)
(package! flycheck-stan)

(package! julia-mode :pin "7aafa8e77df64a47fa4729a0c1ea572b5bc8e30e")
(package! julia-repl :pin "57a15dfafed680ad7d81f779d414e8cb6717417c")

(package! eglot-jl :pin "2e04597223553a369dd5b6520b6365b41e6ea508")
(package! lsp-julia :pin "d6688bb131ff4a5a0201f6d3826ef0b018265389")

;;-- Footer
;; Copyright (C) 2024 john
;;
;; Author:     john <https://github.com/jgrey4296>
;; Maintainer: john <john@john-UM700>
;; Created:    September 09, 2024
;; Modified:   September 09, 2024
;; Version: 0.0.1
;; Keywords:
;; Homepage: https://github.com/jgrey4296
;; Package-Requires: ((emacs "24.3"))
;; Package written on: ((emacs 29.1))
;;
;; This file is not part of GNU Emacs.
;;
;;-- end Footer
;;; packages.el ends here
