;; -*- no-byte-compile: t; -*-
;;; lang/web/packages.el

;; +html.el
(package! emmet-mode)
(package! haml-mode)
(package! pug-mode)
(package! slim-mode)
(package! company-web)
(package! jinja2-mode)
(package! web-mode)

(package! poly-ansible)
(package! polymode)
(package! poly-rst)

;; +css.el
(package! css-mode)
(package! less-css-mode)
(package! counsel-css)

(package! sass-mode)
(package! stylus-mode)
(package! sws-mode)
(package! rainbow-mode)
(package! counsel-css)
