
(package! agentspeak-mode :recipe (:local-repo "~/.doom.d/packages/ai_and_logic/agentspeak-mode"))
(package! ceptre-mode :recipe (:local-repo "~/.doom.d/packages/ai_and_logic/ceptre-mode"))
(package! clips-mode)
(package! instal-mode :recipe (:local-repo "~/.doom.d/packages/ai_and_logic/instal-mode"))
(package! jacamo-mode :recipe (:local-repo "~/.doom.d/packages/ai_and_logic/jacamo-mode"))
(package! ob-ccalc :recipe `(:local-repo ,(expand-file-name "~/.doom.d/packages/ai_and_logic/ob-ccalc")))
(package! ob-clingo :recipe `(:local-repo ,(expand-file-name "~/.doom.d/packages/ai_and_logic/ob-clingo")))
(package! ob-prolog)
(package! proof-general)
(package! soar-mode :recipe (:local-repo "~/.doom.d/packages/ai_and_logic/soar-mode"))
(package! versu-mode :recipe (:local-repo "~/.doom.d/packages/ai_and_logic/versu-mode"))
(package! netlogo-mode :recipe (:local-repo "~/.doom.d/packages/ai_and_logic/netlogo-mode"))
