(package! abl-mode        :recipe (:local-repo "~/.doom.d/packages/ai_and_logic/abl-mode"))
(package! agentspeak-mode :recipe (:local-repo "~/.doom.d/packages/ai_and_logic/agentspeak-mode"))
(package! ceptre-mode     :recipe (:local-repo "~/.doom.d/packages/ai_and_logic/ceptre-mode"))
(package! clips-mode)
(package! instal-mode     :recipe (:local-repo "~/github/MAS/instal-stable/instal-mode"))
(package! jacamo-mode     :recipe (:local-repo "~/.doom.d/packages/ai_and_logic/jacamo-mode"))
(package! netlogo-mode    :recipe (:local-repo "~/.doom.d/packages/ai_and_logic/netlogo-mode"))
(package! proof-general)
(package! soar-mode       :recipe (:local-repo "~/.doom.d/packages/ai_and_logic/soar-mode"))
(package! versu-mode      :recipe (:local-repo "~/.doom.d/packages/ai_and_logic/versu-mode"))
(package! pasp-mode)
(package! z3-mode)

(package! ob-ccalc        :recipe `(:local-repo "~/.doom.d/packages/org-babel-ext" :files ( "ob-ccalc.el" )))
(package! ob-ceptre       :recipe `(:local-repo "~/.doom.d/packages/org-babel-ext" :files ( "ob-ceptre.el" )))
(package! ob-clingo       :recipe `(:local-repo "~/.doom.d/packages/org-babel-ext" :files ( "ob-clingo.el" )))
(package! ob-clips        :recipe `(:local-repo "~/.doom.d/packages/org-babel-ext" :files ( "ob-clips.el" )))
(package! ob-instal       :recipe `(:local-repo "~/.doom.d/packages/org-babel-ext" :files ( "ob-instal.el" )))
(package! ob-prolog)
(package! ob-soar         :recipe `(:local-repo "~/.doom.d/packages/org-babel-ext" :files ( "ob-soar.el" )))
(package! ob-z3           :recipe `(:local-repo "~/.doom.d/packages/org-babel-ext" :files ( "ob-z3.el" )))
