;; (package! fci)
(package! rainbow-mode)
(package! evil-string-inflection)
(package! free-keys)
(package! fsm)
(package! dired-quick-sort)
(package! highlight-parentheses)
(package! plantuml-mode)
(package! flycheck-plantuml)
(package! undo-tree)

(load! "+exclusions")
