;; -*- no-byte-compile: t; -*-
;;; util/text/packages.el
(package! academic-phrases)
(package! evil-string-inflection)
(package! lorem-ipsum)
(package! rainbow-mode)
(package! highlight-parentheses)
(package! helm-wordnet)
(package! wordnut)
(package! rotate-text)
(package! license-templates)
