(package! abl-mode        :recipe `(:local-repo ,(expand-file-name "packages/major-modes/ai_and_logic/abl-mode" doom-user-dir)))
(package! agentspeak-mode :recipe `(:local-repo ,(expand-file-name "packages/major-modes/ai_and_logic/agentspeak-mode" doom-user-dir)))
(package! ceptre-mode     :recipe `(:local-repo ,(expand-file-name "packages/major-modes/ai_and_logic/ceptre-mode" doom-user-dir)))
(package! clips-mode)
(package! instal-mode     :recipe `(:local-repo ,(expand-file-name "~/github/python/instal/instal-mode")))
(package! jacamo-mode     :recipe `(:local-repo ,(expand-file-name "packages/major-modes/ai_and_logic/jacamo-mode" doom-user-dir)))
(package! netlogo-mode    :recipe `(:local-repo ,(expand-file-name "packages/major-modes/ai_and_logic/netlogo-mode" doom-user-dir)))
(package! proof-general)
(package! soar-mode       :recipe `(:local-repo ,(expand-file-name "packages/major-modes/ai_and_logic/soar-mode" doom-user-dir)))
(package! versu-mode      :recipe `(:local-repo ,(expand-file-name "packages/major-modes/ai_and_logic/versu-mode" doom-user-dir)))
(package! pasp-mode)
(package! z3-mode)

(package! ob-ccalc        :recipe `(:local-repo ,(expand-file-name "packages/org-babel-ext" doom-user-dir) :files ( "ob-ccalc.el" )))
(package! ob-ceptre       :recipe `(:local-repo ,(expand-file-name "packages/org-babel-ext" doom-user-dir) :files ( "ob-ceptre.el" )))
(package! ob-clingo       :recipe `(:local-repo ,(expand-file-name "packages/org-babel-ext" doom-user-dir) :files ( "ob-clingo.el" )))
(package! ob-clips        :recipe `(:local-repo ,(expand-file-name "packages/org-babel-ext" doom-user-dir) :files ( "ob-clips.el" )))
(package! ob-instal       :recipe `(:local-repo ,(expand-file-name "packages/org-babel-ext" doom-user-dir) :files ( "ob-instal.el" )))
(package! ob-prolog)
(package! ob-soar         :recipe `(:local-repo ,(expand-file-name "packages/org-babel-ext" doom-user-dir) :files ( "ob-soar.el" )))
(package! ob-z3           :recipe `(:local-repo ,(expand-file-name "packages/org-babel-ext" doom-user-dir) :files ( "ob-z3.el" )))
