;; (package! fci)
(package! free-keys)
(package! fsm)
(package! undo-tree)
(package! cedet :built-in 'prefer)
(package! f)
(package! avy)
(package! dired-quick-sort)
(package! evil)
(package! evil-iedit-state)
(package! evil-quickscope)
(package! evil-snipe)
(package! exec-path-from-shell)
(package! flycheck)
(package! neotree)
(package! origami)
(package! shell-pop)
(package! vlf)
(package! evil-iedit-state)
(package! semantic)
(package! timeline-mode :recipe (:local-repo "~/.doom.d/packages/timeline-mode"))

;; Disables
(package! 2048-game       :disable t)
(package! ace-link        :disable t)
(package! desktop         :disable t)
(package! doc-view        :disable t)
(package! erc             :disable t)
(package! fancy-battery   :disable t)
(package! golden-ratio    :disable t)
(package! helm-cscope     :disable t)
(package! helm-games      :disable t)
(package! jabber          :disable t)
(package! open-junk-file  :disable t)
(package! paradox         :disable t)
(package! pyenv           :disable t)
(package! rcirc           :disable t)
(package! ruby-test-mode  :disable t)
(package! selectric-mode  :disable t)
(package! slack           :disable t)
(package! smex            :disable t)
(package! sudoku          :disable t)
(package! tetris          :disable t)
(package! typit           :disable t)
(package! xcscope         :disable t)
(package! xkcd            :disable t)
(package! zoom-frm        :disable t)
(package! evil-easymotion :disable t)
(package! xt-mouse        :disable t)
(package! mouse           :disable t)
