;; (package! fci)
(package! flycheck-plantuml)
(package! free-keys)
(package! fsm)
(package! highlight-parentheses)
(package! plantuml-mode)
(package! rainbow-mode)
(package! undo-tree)

(package! 2048-game         :disable t)
(package! ace-link          :disable t)
(package! desktop           :disable t)
(package! doc-view          :disable t)
(package! erc               :disable t)
(package! fancy-battery     :disable t)
(package! golden-ratio      :disable t)
(package! helm-cscope       :disable t)
(package! helm-games        :disable t)
(package! jabber            :disable t)
(package! open-junk-file    :disable t)
(package! paradox           :disable t)
(package! pyenv             :disable t)
(package! rcirc             :disable t)
(package! ruby-test-mode    :disable t)
(package! selectric-mode    :disable t)
(package! slack             :disable t)
(package! smex              :disable t)
(package! sudoku            :disable t)
(package! tetris            :disable t)
(package! typit             :disable t)
(package! xcscope           :disable t)
(package! xkcd              :disable t)
(package! zoom-frm          :disable t)
(package! evil-easymotion   :disable t)

;;(package! flx-ido           :disable t)
;;(package! ido-vertical-mode :disable t)
;;(package! ido               :disable t)
;;(package! git-gutter       :disable t)
;;(package! git-gutter+      :disable t)
;;(package! smartparens      :disable t)
;;(package! smartparens-mode :disable t)
;;(package! show-paren-mode  :disable t)
