;; (package! fci)
(package! flycheck-plantuml)
(package! plantuml-mode)
(package! free-keys)
(package! fsm)
(package! undo-tree)
(package! ob-plantuml :recipe (:local-repo "~/.doom.d/packages/ob-plantuml"))

(package! 2048-game       :disable t)
(package! ace-link        :disable t)
(package! desktop         :disable t)
(package! doc-view        :disable t)
(package! erc             :disable t)
(package! fancy-battery   :disable t)
(package! golden-ratio    :disable t)
(package! helm-cscope     :disable t)
(package! helm-games      :disable t)
(package! jabber          :disable t)
(package! open-junk-file  :disable t)
(package! paradox         :disable t)
(package! pyenv           :disable t)
(package! rcirc           :disable t)
(package! ruby-test-mode  :disable t)
(package! selectric-mode  :disable t)
(package! slack           :disable t)
(package! smex            :disable t)
(package! sudoku          :disable t)
(package! tetris          :disable t)
(package! typit           :disable t)
(package! xcscope         :disable t)
(package! xkcd            :disable t)
(package! zoom-frm        :disable t)
(package! evil-easymotion :disable t)
(package! xt-mouse        :disable t)
(package! mouse           :disable t)
