;; -*- no-byte-compile: t; -*-
;;; completion/ivy/packages.el

(package! swiper)
(package! ivy)
(package! ivy-hydra)
(package! ivy-rich)
(package! counsel)
(package! cl-lib :built-in t)
(package! amx)
(package! counsel-projectile)
(package! wgrep)
(package! helm)
(package! helm-gtags)
