;; -*- no-byte-compile: t; -*-
;;; lang/emacs-lisp/packages.el

(package! elisp-mode :built-in t)
(package! ffap)
(package! find-func)
(package! racket-mode)

(package! elisp-mode :built-in t)

;; Fontification plugins
(package! highlight-quoted)

;; Tools
(package! macrostep)
(package! overseer)
(package! elisp-def)
(package! elisp-demos)
(package! flycheck-package)

;; Libraries
(package! buttercup)
(package! a)

(package! elisp-depmap)
