;; -*- no-byte-compile: t; -*-
;;; domain-specific/bibtex/packages.el

(package! bibtex :built-in 'prefer)
(package! cl-lib)
(package! dash)
(package! evil)
(package! helm)
(package! helm-bibtex)
(package! hydra)
(package! org-ref)
